Repository: NamLQ/matrix2018_translation
Catalog: translation-level2.tmx
Source language: en_us
Languages: vi

source: 100,000 case studies had grown to a shade over quarter of a million.
vi: Từ 100.000 nghiên cứu điển hình đã tăng lên hơn một phần tư triệu.

source: 3D-Printing: Once in a while, the whole contradiction story takes a 180degree turn.
vi: In 3D: Thỉnh thoảng, toàn bộ câu chuyện mâu thuẫn quay ngoắt 180 độ.

source: A bigger, much more ‘intangibles’ focused tool and a lot more data, with, today, over three- quarters of a million business-focused case studies – thanks in no small part to a still increasing propensity for US business to at least attempt to patent their contradiction-solving business models and concept innovations.
vi: Một công cụ lớn hơn, tập trung hơn vào "tài sản vô hình" và nhiều dữ liệu hơn, với trên ba phần tư triệu nghiên cứu điển hình tập trung vào kinh doanh. Điều này có được nhờ một phần không nhỏ vào xu hướng ngày càng tăng của các doanh nghiệp Hoa Kỳ ít nhất là cố gắng để cấp bằng sáng chế cho các mô hình kinh doanh giải quyết mâu thuẫn và đổi mới khái niệm của họ.

source: A conspiracy of causes that lead to extraordinary non-linear growth one day can lead to abject failure the next.
vi: Một dự phần nguyên nhân dẫn đến tăng trưởng phi tuyến phi thường vào ngày này lại có thể dẫn đến sự thất bại thảm hại vào ngày tiếp theo.

source: A first version of that taxonomy – a 31x31 Matrix – was first revealed to the world in 2001 (Reference 4).
vi: Phiên bản phân loại đầu tiên - Ma trận 31x31 - lần đầu được tiết lộ với thế giới vào năm 2001 (Tham khảo 4).

source: A higher fee is based on a higher risk of loss, and vice-versa.
vi: Một khoản phí cao hơn dựa vào rủi ro tổn thất cao hơn và ngược lại.

source: A small amount of effort delivers considerable improvement in the system.
vi: Một lượng nhỏ nỗ lực mang lại sự cải thiện đáng kể trong hệ thống.

source: A subset of this model is the organization that successfully goes through a period of non-linear growth and gets approached directly by the publishers: ‘please could you write up your recipe for success?’.
vi: Một tập hợp con của mô hình này là một tổ chức đã trải qua giai đoạn tăng trưởng phi tuyến tính một cách thành công và được các nhà xuất bản tiếp cận trực tiếp: 'bạn có thể viết công thức thành công của mình được không?'

source: A virtuous cycle appears.
vi: Một vòng phát triển (virtuous cycle) xuất hiện.

source: Ability To Measure
vi: Khả năng đo lường

source: Abstracting this problem onto the terms of the Business Matrix, The Geography Of Genius is all about an Adaptability- versus-Control Complexity conflict.
vi: Tóm tắt vấn đề này vào các điều khoản của Ma trận kinh doanh, Địa lý của thiên tài là tất cả về một cuộc xung đột phức tạp thích ứng so với kiểm soát.

source: Accountants and economists ruled the roost.
vi: Kế toán viên và kinh tế gia đã điều khiển cuộc chơi.

source: Actually, first up it gave us a clearer insight into the actual contradiction, by revealing this quote from Hsieh: ‘Zappos is growing, we’ve reached fifteen hundred employees, and we need to scale without losing our entrepreneurial culture or getting bogged down in bureaucracy’.
vi: Trên thực tế, trước tiên nó cho chúng tôi cái nhìn sâu sắc hơn về mâu thuẫn thực sự, bằng cách tiết lộ câu nói này của Hsieh: 'Zappos đang phát triển, chúng tôi đã đạt tới 1.500 nhân viên và chúng tôi cần mở rộng quy mô mà không làm mất đi văn hóa kinh doanh của mình hoặc sa lầy vào quan liêu'

source: Adaptability/Versatility
vi: Khả năng thích ứng / Tính linh hoạt

source: Admittedly it will be a complex system.
vi: Phải thừa nhận rằng đó là một hệ thống phức tạp.

source: Admittedly, many of these are weak (according to our IP quality measurement tool, ApolloSigma – Reference 11), but even if 85% of the patents go straight into our trash-can, that still leaves a substantial number of cases per week to potentially add to the database.
vi: Phải thừa nhận rằng nhiều trong số này là yếu (theo công cụ đo lường chất lượng IP của chúng tôi, ApolloSigma - Tham khảo 11), nhưng ngay cả khi 85% bằng sáng chế tới thẳng thùng rác thì vẫn còn số lượng đáng kể các trường hợp mỗi tuần được đưa vào cơ sở dữ liệu.

source: After a year, they began to realise there weren’t very many of these contradiction-solving strategies, and the foundations of the inventive problem solving method the world now knows as ‘TRIZ’ were born.
vi: Sau một năm họ bắt đầu nhận ra rằng không có nhiều chiến lược giải quyết mâu thuẫn này, và nền tảng của phương pháp giải quyết vấn đề sáng tạo mà ngày nay thế giới gọi là "TRIZ" đã ra đời.

source: Again intended to be general, the terms relate to the quality of what is produced, and the means by which we achieve it.
vi: Dụng ý tổng quát một lần nữa, các thuật ngữ liên quan đến chất lượng của thứ được sản xuất, và phương tiện mà dựa vào đó chúng ta đạt được.

source: Again intended to be general, the terms relate to the quality of what is produced, the capability available within an enterprise to achieve the desired output, and the means by which we achieve it.
vi: Nói chung một lần nữa khái niệm trên liên quan đến chất lượng của sản phẩm được sản xuất, năng lựng có sẵn trong một doanh nghiệp để đạt được đầu ra mong muốn, và phương tiện để chúng ta đạt được kết quả đó.

source: Again, as in the world of technology, the decision was made easier through the emergence of semantic search technologies that allowed us to analyse lots of literature in a relatively short amount of time.
vi: Một lần nữa, như trong thế giới công nghệ, quyết định được đưa ra dễ dàng hơn nhờ sự xuất hiện của các công nghệ tìm kiếm ngữ nghĩa cho phép chúng tôi phân tích nhiều tài liệu trong một khoảng thời gian tương đối ngắn.

source: Again, as we’ll see shortly, there are multiple strategies and methods for revealing which vicious cycles and contradictions are causing you to be stuck at the top of your own curve.
vi: Một lần nữa, như ta sẽ thấy ngay sau đây, có nhiều chiến lược và phương pháp để bộc lộ những vòng luẩn quẩn và mâu thuẫn nào đang khiến bạn bị mắc kẹt ở đỉnh của chính đường cong của mình.

source: All of them containing the same basic (contradiction-solving) insight that Edward De Bono wrote about in the late 1960s.
vi: Tất cả chúng đều chứa đựng cùng một cái nhìn sâu sắc cơ bản (giải quyết mâu thuẫn) mà Edward De Bono đã viết vào cuối những năm 1960.

source: All we need to do to find them all is work out that they co-exist hierarchically.
vi: Mọi điều ta cần làm để tìm được tất cả chúng là tìm ra cách chúng cùng tồn tại theo thứ bậc.

source: Almost everyone will recognise that the jump from land-line to cellular telephony was a step-change.
vi: Hầu hết mọi người sẽ nhận ra rằng việc chuyển từ điện thoại cố định sang điện thoại di động là một bước thay đổi.

source: Also in the Holacracy book, we find the story of the Zappos call centre operator that received a call from an apparently distraught customer who, having the week before bought a pair of shoes for her father, indicated that her father had passed away just after the shoes arrived and could she have a refund.
vi: Cũng trong cuốn sách Holacracy, chúng tôi tìm thấy câu chuyện về nhân viên điều hành trung tâm chăm sóc khách hàng của Zappos đã nhận được một cuộc gọi từ một khách hàng có vẻ như đang quẫn trí, người mà tuần trước đó đã mua một đôi giày cho cha cô ấy, cho biết rằng cha cô ấy đã qua đời ngay sau khi đôi giày được đưa đến và liệu rằng cô ấy có thể được hoàn lại tiền hay không.

source: Altshuller was, crudely speaking, tasked with distinguishing ‘good’ patents from ‘bad’ ones.
vi: Nói một cách thô thiển, Altshuller được giao nhiệm vụ phân biệt bằng sáng chế "tốt" với bằng sáng chế "xấu".

source: Altshuller’s Contradiction Matrix research is today is clouded in considerable mystery and mythologizing.
vi: Nghiên cứu về Ma trận Mâu thuẫn của Altshuller ngày nay bị bao phủ bởi nhiều bí ẩn và huyền thoại.

source: Amount Of Information
vi: Lượng thông tin

source: And in the world of business, where everything is increasingly connected to everything else, success becomes ever more fleeting.
vi: Và trong thế giới kinh doanh, nơi mọi thứ ngày càng được kết nối với nhau thì thành công càng trở nên phù du hơn bao giờ hết.

source: And now we’re somewhere close to a ‘first principles’, ‘DNA’ level understanding of whether and how the contradiction has been solved.
vi: Và bây giờ chúng ta đang ở đâu đó gần với ‘nguyên tắc đầu tiên’, sự hiểu biết ở mức độ ’DNA’ về việc liệu và làm thế nào mâu thuẫn đã được giải quyết.

source: And so the first Contradiction Matrix was born.
vi: Và thế là Ma trận Mâu thuẫn đầu tiên ra đời.

source: And so those are the boxes within the Matrix where Principle 13 is added to the running total of Principles found as solution strategies for that particular combination of improving and worsening features.
vi: Và đó là những ô trong Ma trận nơi nguyên tắc 13 được thêm vào tổng số các nguyên tắc được tìm thấy dưới dạng các chiến lược giải pháp cho sự kết hợp cụ thể giữa các thông số được cải thiện và các thông số kém đi.

source: And so – surprise, surprise – any and all kinds of success managed to have a SixSigma-did-this label attached to them.
vi: Và thế là – ngạc nhiên chưa – với bất kỳ và với mọi loại thành công đều có cái nhãn “Six Sigma đã làm điều này” gắn vào.

source: And so, here we are, with a new 45x45 size version of the Business Matrix – our ‘3.0’ version of the tool.
vi: Và vì vậy, chúng tôi có phiên bản mới với kích thước 45x45 của Ma trận kinh doanh – phiên bản công cụ "3.0".

source: And thanks too, finally, to the recently released PanSensic ‘Contradiction Finder’ tool – a semantic narrative search tool that will automatically scrape through swathes of text (email traffic, social media, business literature, etc) to identify not just the conflicts and contradictions that people are talking about, but also, how they’re (occasionally – the business world still isn’t so good at this kind of ‘third- way’ stuff) able to deliver a contradiction-solving breakthrough solution.
vi: Và cuối cùng, cũng xin cảm ơn công cụ "Trình tìm mâu thuẫn" PanSensic được phát hành gần đây – một công cụ tìm kiếm tường thuật ngữ nghĩa tự động quét qua các dải văn bản (lưu lượng truy cập email, phương tiện truyền thông xã hội, tài liệu kinh doanh, v.v.) để xác định không chỉ các xung đột và mâu thuẫn mà mọi người đang nói đến, cũng như cách họ (đôi khi – thế giới kinh doanh vẫn chưa giỏi lắm về loại công việc "con đường thứ ba") có thể đưa ra một giải pháp đột phá giải quyết mâu thuẫn.

source: And that near-enough brings us up to the present day.
vi: Và điều đó gần như là đủ đưa chúng ta đến ngày nay.

source: And the contradiction.
vi: Và mâu thuẫn.

source: And then it doesn’t.
vi: Và sau đó thì không.

source: And then the 2008 GFC happened, and we all started to realise what our guts (and W. Edwards Deming) had been telling us for a long time, ‘the most important numbers are unknown and unknowable’.
vi: Và rồi khủng hoảng tài chính năm 2008 xảy ra, và tất cả chúng ta bắt đầu nhận ra điều mà trái tim của mình (và W. Edwards Deming) đã nói trong một thời gian dài, "những con số quan trọng nhất là không biết và không thể biết được".

source: And therefore the vicious cycle.
vi: Và do vậy là cái vòng luẩn quẩn.

source: And thus we have several entries that can be added to the tally for the Adaptability-versus-Control-Complexity box in the Matrix.
vi: Và do đó chúng tôi có một số mục có thể được thêm vào kiểm đếm cho thông số "Sự thích ứng" mâu thuẫn với "Sự phức tạp kiểm soát" của Ma trận.

source: And, we later found, the same applied to IT, architecture, music, literature, politics, you-name-it, it’s the same basic 40 Principles.
vi: Và, sau đó chúng tôi nhận thấy, điều tương tự cũng được áp dụng cho CNTT, kiến trúc, âm nhạc, văn học, chính trị, bạn có thể đặt tên cho nó, đó là cùng 40 Nguyên tắc cơ bản.

source: Answer?
vi: Câu trả lời là gì?

source: Aristotle, Plato and, particularly, Socrates, pontificated seemingly endlessly about the so- called dialectic.
vi: Aristotle, Plato và, đặc biệt là Socrates, dường như đã tuyên bố không ngừng về cái gọi là phép biện chứng.

source: As it happens, there was no need for that as not only does it flow considerably more traffic than the conventional design, but it’s also significantly less prone to traffic accidents.
vi: Thực tế không cần sơn lại là do không chỉ lưu lượng giao thông nhiều hơn đáng kể so với thiết kế thông thường mà còn ít bị tai nạn giao thông hơn một cách đáng kể.

source: At first – through the last three years of the 1990s – we were trying to confirm our, we now know, naïve belief that when business leaders and entrepreneurs ‘solve contradictions’ they would be using a whole bunch of different strategies to the ones used by technologists.
vi: Lúc đầu – suốt ba năm cuối của thập niên 1990 – chúng tôi cố gắng khẳng định niềm tin ngây thơ của mình, mà bây giờ chúng tôi biết, rằng khi các nhà lãnh đạo doanh nghiệp và doanh nhân “giải quyết mâu thuẫn”, họ sẽ sử dụng một loạt các chiến lược khác với những chiến lược được sử dụng bởi các nhà công nghệ.

source: At first, this effort reaps rich rewards.
vi: Lúc đầu, nỗ lực này gặt hái những phần thưởng phong phú.

source: At least for a while… until the next (inevitable) vicious cycle kicks into play.
vi: Ít nhất là trong một thời gian... cho đến khi vòng luẩn quẩn tiếp theo (không thể tránh khỏi) bắt đầu phát huy tác dụng.

source: At the end of this piece of work, the conclusion was that solving ‘business contradictions’ used precisely the same set of Inventive Principles that were used to solve ‘technology problems’.
vi: Khi kết thúc công việc này, kết luận là việc giải quyết "mâu thuẫn trong kinh doanh" đã sử dụng chính xác cùng các Nguyên tắc sáng tạo được sử dụng để giải quyết "các vấn đề công nghệ".

source: Autonomy
vi: Tính tự quản

source: Averaged list of other Principles that should be considered where we wish to improve this parameter (decreasing order of frequency):
vi: Danh sách bình quân (tần suất giảm dần) các nguyên tắc khác cần được xem xét khi chúng ta muốn cải thiện tham số này:

source: Back in 2004, the world of business – at least in terms of how businesses were taught to be managed – was very much about tangibles.
vi: Quay trở lại năm 2004, thế giới kinh doanh – ít nhất là về cách thức quản lý doanh nghiệp – thiên về những thứ hữu hình.

source: Belonging
vi: Thuộc về

source: Business Matrix 3.0
vi: Ma trận kinh doanh 3.0

source: Business success, in other words, was increasingly all about the intangibles.
vi: Nói cách khác, thành công trong kinh doanh ngày càng tập trung vào những thứ vô hình.

source: But because s-curves are literally everywhere, some discontinuous jumps are bigger than others.
vi: Nhưng vì các đường cong chữ s thực sự có ở khắp mọi nơi nên một số bước nảy không liên tục sẽ lớn hơn những bước nhảy khác.

source: But it is totally different to ‘solving the contradiction’.
vi: Nhưng nó khác hoàn toàn với việc "giải quyết mâu thuẫn".

source: But it was only in the patent research conducted by Genrich Altshuller starting from 1946 that the true significance of contradiction-solving became apparent.
vi: Nhưng chỉ trong việc nghiên cứu bằng sáng chế do Genrich Altshuller thực hiện bắt đầu từ năm 1946 thì ý nghĩa thực sự của việc giải quyết mâu thuẫn mới trở nên rõ ràng.

source: But more than both of those things, it’s an attempt to understand at a first-principles level what are the unifying features of each of these regions.
vi: Nhưng hơn cả những điều đó, đó là một nỗ lực để hiểu ở cấp độ nguyên tắc đầu tiên, các đặc điểm thống nhất của từng khu vực này là gì.

source: But then try and apply the same s-curve thinking to things like staff engagement, or customer trust, or Net Promoter Scores, or ‘value demand’, or how productive they’re able to be during a working day, or quality improvement programmes, and a disconnect occurs.
vi: Nhưng sau đó hãy thử áp dụng cùng lối tư duy đường cong chữ s cho những thứ như: mức độ gắn kết của nhân viên, sự tin tưởng của khách hàng, chỉ số đo lường lòng trung thành của khách hàng (Net Promoter Scores), "nhu cầu giá trị", mức độ hiệu quả mà họ có thể đạt được trong một ngày làm việc, hoặc các chương trình cải tiến chất lượng, và một sự ngắt kết nối xảy ra.

source: But then, somehow, when it comes to connecting it to themselves, the work they do, and the systems they operate within, something seems to go awry.
vi: Nhưng sau đó, bằng cách nào đó, khi kết nối với chính họ, với công việc họ làm và với hệ thống họ vận hành nội tại thì dường như có điều gì đó không ổn.

source: By 2003, working in conjunction with some of the key members of Altshuller’s team (Genrich Altshuller had sadly passed away in 1998), and adding close to a million additional patent analyses, it was possible to publish a completely new version of the Matrix (Reference 2).
vi: Đến năm 2003, qua làm việc cùng với một số thành viên chủ chốt trong nhóm của Altshuller (đáng buồn là Genrich Altshuller đã qua đời vào năm 1998), và thêm gần một triệu phân tích bằng sáng chế bổ sung, thì có thể cho ra đời một phiên bản hoàn toàn mới của Ma trận (Tham khảo 2).

source: By 2004, we had sufficient verification and validation evidence from a brave lead community of Business Matrix users to justify expanding the research.
vi: Đến năm 2004, chúng tôi đã có đủ bằng chứng xác minh và xác thực từ một cộng đồng dẫn đầu dũng cảm những người dùng Ma trận Kinh doanh để chứng minh cho việc mở rộng nghiên cứu là đúng.

source: By 2012, we’d worked on enough client projects to learn that things like autonomy and trust are in actual fact eminently measurable (hence our spin-out of the ‘PanSensic’ measurement tools), and, not long after that, that we could use those measurements to create and reverse engineer a statistically significant number of case studies to meaningfully populate a Matrix tool with this extended taxonomy.
vi: Đến năm 2012, chúng tôi đã làm việc với các dự án của khách hàng đủ để biết được rằng những thứ như quyền tự chủ và lòng tin có thể được đo lường rõ ràng trong thực tế (do đó, chúng tôi đã loại bỏ các công cụ đo lường "PanSensic"). Không lâu sau đó, chúng tôi có thể sử dụng các phép đo lường để tạo ra và đảo ngược kỹ thuật một số lượng đáng kể về mặt thống kê các nghiên cứu điển hình để tạo thành một cách có ý nghĩa công cụ Ma trận với phân loại mở rộng này.

source: By way of an example, US9,418,383 was granted to State Farm Mutual Insurance in August 2016.
vi: Bằng một ví dụ, bằng sáng chế số hiệu US9.418.383 được cấp cho State Farm Mutual Insurance (Bảo hiểm hỗ tương trang trại nhà nước) vào tháng 8 năm 2016.

source: By which time the Systematic Innovation research team, now aided by some smart semantic search software, had added several million more patent analyses and had published Matrix 2010 (Reference 3).
vi: Vào thời điểm đó, nhóm nghiên cứu Đổi mới Hệ thống, hiện được hỗ trợ bởi một số phần mềm tìm kiếm ngữ nghĩa thông minh, đã bổ sung thêm vài triệu bản phân tích bằng sáng chế và đã xuất bản Ma trận 2010 (Tham khảo 3).

source: Catalysts/Nourishers (+ve Intangibles)
vi: Nhân tố kích thích / Nhân tố nuôi dưỡng

source: Communication Flow
vi: Luồng truyền thông

source: Competence
vi: Năng lực

source: Control Complexity
vi: Kiểm soát độ phức tạp

source: Convenience
vi: Tiện lợi

source: Cost: anything relating to financial matters.
vi: Chi phí: bất kỳ điều gì liên quan tới vấn đề tài chính.

source: Costs can be direct or indirect, visible or invisible, now or in the future.
vi: Chi phí có thể trực tiếp hay gián tiếp, rõ ràng hay không rõ ràng, hiện tại hoặc trong tương lai.

source: Costs can be direct or indirect, visible or invisible, tangible or intangible.
vi: Chi phí có thể trực tiếp hoặc gián tiếp, rõ ràng hay không thể trông thấy, vô hình hay hữu hình.

source: Customer Feedback
vi: Phản hồi của khách hàng

source: Customer Loyalty
vi: Lòng trung thành của khách hàng

source: Customer Revenue
vi: Doanh thu khách hàng

source: Data Acquisition Methods
vi: Phương pháp thu thập dữ liệu.

source: Description
vi: Miêu tả

source: Design Cost
vi: Chi phí thiết kế

source: Design Interfaces
vi: Giao diện thiết kế

source: Design Risk
vi: Rủi ro thiết kế

source: Design Spec/Capability/Means
vi: Thông số kỹ thuật / Năng lực / Phương tiện thiết kế

source: Design Time
vi: Thời gian thiết kế

source: Each bit of improvement effort that goes in to the system, delivers a higher level of improvement.
vi: Từng chút nỗ lực cải tiến đi vào hệ thống mang lại mức độ cải tiến cao hơn.

source: Emergence of contradictions, emergence of a ‘root contradiction’ and the eventual resolution of that contradiction.
vi: Là sự xuất hiện của các mâu thuẫn, của một “mâu thuẫn gốc rễ” và giải pháp cuối cùng cho mâu thuẫn đó.

source: Engagement
vi: Sự cam kết

source: Eric Weiner (Reference 8) is one of those people, and his book The Geography Of Genius is a rattlingly good read.
vi: Eric Weiner (Tham khảo 8) là một trong những người như vậy, và cuốn sách “Địa lý Của Thiên tài” của ông ấy hay một cách đáng kinh ngạc.

source: Even the most cursory of glances at The Halo Effect (Reference 6), one of the most disruptive management texts of the last twenty years, will tell readers that attempts to decode the reasons for the success of an enterprise very easily fall foul of mythology, ego and a mis-reading of a situation by outsiders.
vi: Ngay cả cái nhìn thoáng qua nhất về Hiệu ứng Hào quang (The Halo Effect - Tham khảo 6), một trong những văn bản về quản lý đột phá nhất trong hai mươi năm qua, sẽ cho người đọc biết rằng các nỗ lực giải mã lý do thành công của một doanh nghiệp rất dễ rơi vào chuyện thần thoại, vào cái tôi, và sự hiểu sai tình huống của người ngoài cuộc.

source: Even though it very definitely, when we look closely enough, involved a discontinuous jump.
vi: Mặc dù rất chắc chắn như vậy nhưng khi chúng ta quan sát đủ kỹ thì nó lại liên quan tới một bước nhảy không liên tục.

source: Even though they might look superficially ‘the same’.
vi: Thậm chí dù bề ngoài chúng có thể trông "giống nhau".

source: Everyone knows ‘you can’t have your cake and eat it’, but some people choose not to accept it.
vi: Mọi người đều biết câu nói: "Bạn không thể vừa giữ nguyên chiếc bánh lại vừa ăn nó", nhưng một số người chọn không chấp nhận điều này.

source: Everything feels like it effects everything else, and usually in unpredictable ways.
vi: Mợi thứ dường như ảnh hưởng tới mọi thứ khác, và thường theo những cách không thể đoán trước.

source: Figure 1 S-Curves & Virtuous/Vicious Cycles.
vi: Hình 1: Đường cong chữ S và các vòng phát triển / luẩn quẩn.

source: Figure 2 S-Curves & Alternating Innovation/Optimization Cycles
vi: Hình 2. Các hình chữ S và các chu kỳ tối ưu/đổi mới thay thế.

source: Figure 3 S-Curves Hierarchies
vi: Hình 3. Thang bậc các đường cong hình S.

source: Figure 4 Corporate Whack-A-Mole & Contradictions
vi: Hình 4. Công ti có nhiều vấn đề nảy sinh nối tiếp nhau và các mâu thuẫn.

source: Figure 5 Magic Roundabout, Swindon
vi: Hình 5: Vòng xuyến ma thuật ở Swindon.
